"ACTION_COULD_NOT_COMPLETE" = "This action couldn’t be completed, because an error occurred:";
"SCRIPTING_ERROR_PREFIX" = "A scripting error has occurred:";

"DEFAULT_DIFF_WINDOW_NAME" = "Differences %hu";

"PREVIEW_CANT_SPAWN_WINDOW" = "Can't Create New Window";
"PREVIEW_CANT_SPAWN_INFORMATIVE" = "The web page you are previewing requested that a new window be created. This action is not supported; please test this functionality in an external web browser.";

"SN_PROMPT_TEMPLATE" = "Serial number: %@";

"MDI_CONFIRM_CLOSE_TRAILER" = "(and %lu others)";

"MY_FILES_AND_FOLDERS" = "My Files & Folders";

"P4_EDIT_UNLOCK_MESSAGE" = "“%@” is being managed by Perforce.";
"P4_EDIT_UNLOCK_INFO" = "Do you want to “p4 edit” it?";
"P4_EDIT_UNLOCK_OK" = "Edit";

"UNLOCK_ACTION_BUTTON" = "Unlock";

"START_SPEAKING" = "Start Speaking";
"STOP_SPEAKING" = "Stop Speaking";

"LANGUAGE_MENU_AUTO" = "(automatic)";
"LANGUAGE_MENU_NONE" = "(none)";

"PCRE_PATTERN_INVALID" = "An error occurred while preparing this Grep pattern.";
"PCRE_ERROR_TEMPLATE" = "This pattern cannot be used, because PCRE reported an error: %@ (%@)";
"PCRE_ERROR_STRING_NOT_AVAILABLE" = "(error message not available)";

"TEXT_OPT_WRAP_CHAR_WIDTH_BUTTON" = "to %lu characters";

"NO_FUNCTIONS_DEFINED" = "(no functions defined)";
"NO_FUNCTION_SELECTED" = "(no function selected)";
"NO_FUNCTIONS_IN_FILE" = "(functions)";

"NEVER_SAVED" = "(never saved)";
"LAST_SAVED_FORMAT" = "Saved: %@";

"NAVBAR_FUNCTIONS" = "Functions";
"NAVBAR_MARKERS" = "Markers";
"NAVBAR_INCLUDES" = "Included Files";
"NAVBAR_COUNTERPARTS" = "Counterparts";
"NAVBAR_OPENDOCS" = "Open Documents";
"NAVBAR_DOCSTATUS" = "Document Status";
"NAVBAR_NEWDOCUMENT" = "(New Document)";

"STATUSBAR_LINEBREAKS" = "Line Break Type";
"STATUSBAR_MAGNIFICATION" = "Text Magnification";
"STATUSBAR_TEXTSTATS" = "Text Statistics";
"STATUSBAR_CURSORPOS" = "Cursor Position";
"STATUSBAR_LANGUAGE" = "Document Language";
"STATUSBAR_ENCODING" = "Document Text Encoding";
"STATUSBAR_SHELLCMD" = "Currently Executing Command";
"STATUSBAR_DOCDATE" = "Document Save Date";
"STATUSBAR_DOCLOCK" = "Document Lock State";
"STATUSBAR_TEXTOPTS" = "Text Options";
"STATUSBAR_CHEATSHEET" = "Cheat Sheet";
"STATUSBAR_LIVESTATS_NO_SEARCH" = "There are no other instances of the selected text in this document; or no search was performed.";
"STATUSBAR_LIVESTATS_IN_PROGRESS" = "A search is in progress for instances of the selected text.";
"STATUSBAR_LIVESTATS_RESULTS_2" = "There are two instances of the selected text in this document.";
"STATUSBAR_LIVESTATS_RESULTS_N" = "There are %@ instances of the selected text in this document.";

"BROWSER_NO_EDITOR" = "No Editor";
"BROWSER_NO_SELECTION" = "No Selection";
"BROWSER_FILE_NOTFOUND" = "-- This file has been moved or deleted, and cannot be located --";
"BROWSER_FOLDER_NOTFOUND" = "-- This folder has been moved or deleted, and cannot be located --";

"SHOW_POD" = "Show POD";
"SHOW_MODULE_DOCUMENTATION" = "Show Module Documentation";

"LINE_END_CR" = "Legacy Mac (CR)";
"LINE_END_LF" = "Unix (LF)";
"LINE_END_CRLF" = "Windows (CRLF)";
"LINE_END_UNICODE" = "Unicode";
"LINE_END_UNKNOWN" = "(unknown)";

"SYSTEM_USERS" = "System Users";
"SYSTEM_GROUPS" = "System Groups";

"EXTRACT_WINDOW_TITLE" = "Extracted occurrences of “%@”";

"PAGE_HEADER_COUNT_FORMAT" = "Page %lu/%lu";
"PAGE_HEADER_PRINT_DATE" = "Printed: ";
"PAGE_HEADER_SAVE_DATE" = "Saved: ";
"PAGE_HEADER_USER_FMT" = "Printed for: %@";

"HEXDUMP_PROGRESS" = "Dumping…";
"TEXT_PREVIEW_TITLE_FMT" = "Text Preview: %@";
"HEXDUMP_OUTPUT_TITLE_FMT" = "Hex Dump for “%@”";
"SORTLINES_OUTPUT_TITLE_FMT" = "%@ — Sorted Lines";
"SORTLINES_OUTPUT_NO_INPUT" = "Script Input";
"PROCESSDUPS_MATCHES_OUTPUT_TITLE_FMT" = "Matching Lines in “%@”";
"PROCESSDUPS_REMAINDER_OUTPUT_TITLE_FMT" = "Remaining Lines from “%@”";
"PROCESSDUPS_NO_INPUT" = "Script Input";
"LINESCONTAINING_OUTPUT_TITLE_FMT" = "%@ — Copied Lines";
"LINESCONTAINING_NO_MATCHES" = "No matches were found.";
"LINESCONTAINING_ONE_MATCH" = "One match was found.";
"LINESCONTAINING_MATCHES_COUNT" = "%@ matches were found.";
"LINESCONTAINING_OUTPUT_NO_INPUT_WINDOW" = "Script Input";

"CANT_UNDO" = "Can’t Undo";
"CANT_REDO" = "Can’t Redo";
"UNDO_FORMAT" = "Undo %@";
"REDO_FORMAT" = "Redo %@";

"NO_COMPLETIONS" = "No completions available.";

"SPELLER_NO_ERRORS" = "No Errors";
"SPELLER_NO_MORE_ERRORS" = "No More Errors";

"SYNTAX_CHECK_OK" = "No Errors";

"COMMAND_PROGRESS_CheckSyntax" = "Checking syntax…";
"COMMAND_PROGRESS_Run" = "Running…";
"COMMAND_PROGRESS_Debug" = "Debugging…";

"NOT_FOUND_ANNOTATION" = "(not found)";

"CONFIRM_CLOSE_SAVE_BUTTON" = "Save";
"CONFIRM_CLOSE_DONT_SAVE_BUTTON" = "Don’t Save";
"CONFIRM_CLOSE_DEFAULT_PROMPT" = "Save changes to “^1” before closing?";
"CONFIRM_CLOSE_MULTI_PROMPT" = "Save documents before closing?";
"CONFIRM_CLOSE_DEFAULT_SECONDARY" = "If you don’t save, your changes will be lost.";
"CONFIRM_CLOSE_ACTION_SELECTED" = "%@ Selected";
"CONFIRM_CLOSE_ACTION_ALL" = "%@ All";
"SAVE_WITH_ELLIPSIS" = "Save…";

"SAVE_SEARCH_SET_ADD" = "Add";
"SAVE_SEARCH_SET_UPDATE" = "Update";

"COLUMN_NAME_FORMAT" = "Column %@";

"LINESORT_TITLE" = "Sorting lines…";
"LINESORT_SORTING" = "Sorting…";
"LINESORT_ANALYZING" = "Analyzing…";
"LINESORT_OUTPUT" = "Generating output…";

"CANON_APPLY_BUTTON" = "Apply";
"LIPSUM_APPLY_BUTTON" = "Generate";

"STOP_BUTTON" = "Stop";
"OPEN_BUTTON" = "Open";

"RELOAD_FROM_DISK" = "Reload from Disk";
"RELOAD_FROM_SERVER" = "Reload from Server";
"CONFIRM_RELOAD_PROMPT" = "“%@” has been changed on disk.";

"CONTINUE_BUTTON_TITLE" = "Continue";
"CLOSE_BUTTON_TITLE" = "Close";

"SIMPLE_MENU_MAIN" = "Set up Simple Menus?";
"SIMPLE_MENU_PROMPT" = "Simple Menus will hide all of BBEdit’s advanced menu commands. The menu structure will be simpler, but some features will not be accessible.\n\nYou can turn specific menus and items back on at any time, if desired.";
"SIMPLE_MENU_OK" = "Simple Menus";
"FULL_MENU_MAIN" = "Restore Full Menus?";
"FULL_MENU_PROMPT" = "All of BBEdit’s menus and commands will be visible, including ones that you might have manually hidden before.";
"FULL_MENU_OK" = "Full Menus";

"PROGRESS_TITLE_FMT" = "%s Progress";
"MP_PROGRESS_NAME" = "Searching “%@”";
"MP_PROGRESS_COUNT" = "%@ occurrences found";

"EVAL_ENDED" = "Free Mode";
"EVAL_EXPIRES_TODAY" = "Free Mode starts today";
"EVAL_ONE_DAY" = "One day until Free Mode";
"EVAL_N_DAYS" = "Evaluation (%@ days left)";

"PREVIEW_REFRESH" = "Refresh preview";
"PREVIEW_SHOW_ORIGINAL" = "Show Original Document";
"PREVIEW_SHOW_INSPECTOR" = "Open inspector";
"PREVIEW_OPEN_IN_BROWSER" = "Open in Browser";

"MANUAL_DOWNLOAD_PROGRESS_MAIN" = "Downloading the user manual…";
"MANUAL_DOWNLOAD_PROGRESS_SUB" = "(%@ received, %@ remaining)";
"MANUAL_DOWNLOAD_PROGRESS_SUB_NO_ESTIMATE" = "(%@ received)";
"MANUAL_DOWNLOAD_HTTP_ERROR_MAIN" = "An error occurred while downloading the user manual.";
"MANUAL_DOWNLOAD_HTTP_ERROR_SUB" = "The server reported: %@ (%@)";

"DOCUMENT_DOWNLOAD_PROGRESS_MAIN" = "Downloading “%@”…";
"DOCUMENT_DOWNLOAD_PROGRESS_SUB" = "(%@ received, %@ remaining)";
"DOCUMENT_DOWNLOAD_PROGRESS_SUB_NO_ESTIMATE" = "(%@ received)";

"SCRIPT_HINT_GREP_REPLACE" = "When writing the script by hand, the following two lines of script can be replaced with a single “set selection of document 1 to (grep substitution of <replacement pattern>)”.";
"SCRIPT_HINT_EXTENDED_COPY" = "This is recorded as “extended copy with append to clipboard” because AppleScript refuses to compile “copy with append to clipboard”.";
"SCRIPT_HINT_CLOSEDELETE" = "When writing the script by hand, you should include two lines here which say: set f to file of document 1, tell application \"Finder\" to move f to trash.  (This cannot be recorded as such.)";

"ADD_LINE_NUMBERS_PROGRESS_MAIN" = "Adding line numbers…";
"REMOVE_LINE_NUMBERS_PROGRESS_MAIN" = "Removing line numbers…";
"PROGRESS_PROCESSING_MAIN" = "Processing…";
"PROCESSING_DUPLICATES_MAIN" = "Processing duplicates…";
"PROGRESS_ANALYZING_SUB" = "(analyzing)";
"PROGRESS_SORTING_SUB" = "(sorting)";
"PROGRESS_GENERATING_OUTPUT_SUB" = "(generating output)";
"PROGRESS_DIFFLIST_MAIN" = "Comparing…";
"PROGRESS_LOADING_PROJECT" = "Loading project…";
"PROGRESS_HARD_WRAP" = "Wrapping…";
"PROGRESS_ZAP_GREMLINS" = "Zapping gremlins…";
"PROGRESS_SEARCHING" = "Searching…";
"PROGRESS_FIND_AND_MARK" = "Marking…";
"PROGRESS_REPLACE_ALL" = "Replacing…";
"PROGRESS_LIST_FOLDER" = "Listing “%@”…";

"COMMIT_BUTTON_TITLE" = "Commit";

"HOST_KEY_VERIFICATION_FAILED_MAIN" = "Host key verification failed.";
"HOST_KEY_VERIFICATION_FAILED_SUB" = "The host key has changed for the remote host. Do you want to edit your “known_hosts” file now?";
"HOST_KEY_EDIT" = "Edit";
"SFTP_CONTINUE_CONNECTING_MAIN" = "Continue connecting?";

"FTP_ERROR_TEMPLATE" = "The FTP server reported an error: %s";

"LANGUAGE_MODULE_PROMPT" = "Add support for additional languages by placing language modules in your $LMFOLDER folder. $LMLIBRARY";
"LMLIBRARY_LINK_TEXT" = "Find more language modules on our web site.";

"TEXT_OPTIONS_POPOVER_TITLE" = "Text Options";
"FILE_INFO_POPOVER_TITLE" = "Info";
"MARKUP_BUILDER_POPOVER_TITLE" = "Markup Builder";

"SERVICE_ERROR_NO_URLS" = "No files were provided.";
"SERVICE_ERROR_NO_STRING" = "No text was provided.";
"SERVICE_ERROR_UNKNOWN" = "This service is not supported.";
"SERVICE_ERROR_DIFF_REQUIRES_TWO" = "You can only choose two items to compare.";
"SERVICE_ERROR_DIFF_REQUIRES_TEXT" = "“%@” needs to be a text file, but does not appear to be one.";
"SERVICE_ERROR_DIFF_SAME_TYPE" = "The items being compared are of different types (one is a file, one is a folder; both must be either files or folders).";

"SERVICE_ERROR_ALERT" = "An error occurred while performing this service.";

"CONFIRM_CLEAR_UNDO_MAIN" = "Really clear the Undo history?";
"CONFIRM_CLEAR_UNDO_SUB" = "If you clear the Undo history, you will not be able to undo any changes you’ve made, nor will you be able to redo any changes you have previously undone.";
"CONFIRM_CLEAR_UNDO_ACTION" = "Clear Undo History";

"LIVE_MATCH_FIRST_ENABLED" = "First Occurrence of “%@”";
"LIVE_MATCH_FIRST_DISABLED" = "First Occurrence of Selected Text";
"LIVE_MATCH_NEXT_PREV_ENABLED" = "%@ Occurrence of “%@”";
"LIVE_MATCH_NEXT_PREV_DISABLED" = "%@ Occurrence of Selected Text";
"LIVE_MATCH_PREVIOUS" = "Previous";
"LIVE_MATCH_NEXT" = "Next";

"DOCK_MENU_SHOW_SCRATCHPAD" = "Show Scratchpad";
"DOCK_MENU_SHOW_WORKSHEET" = "Show Unix Worksheet";
"DOCK_MENU_NEW_DOCUMENT" = "New Text Document";
"DOCK_MENU_NEW_TEXT_WINDOW" = "New Text Window";

"ABOUT_BOX_INTEL" = ", 64-bit Intel";
"ABOUT_BOX_ARM64" = ", Apple Silicon";
"ABOUT_BOX_SANDBOXED" = ", sandboxed";

"UNCAUGHT_EXCEPTION" = "An unexpected error has occurred.";
"UNCAUGHT_EXCEPTION_FATAL" = "BBEdit must quit now.\n\nPlease send email to support@barebones.com with a description of what you were doing when this happened, and a copy of the log file that has just been opened in Console.";
"UNCAUGHT_EXCEPTION_NONFATAL" = "We recommend that you save your work and quit.\n\nPlease send email to support@barebones.com with a description of what you were doing when this happened, and a copy of the log file that will open in Console.";
"UNCAUGHT_EXCEPTION_OK" = "OK";

"SEARCH_IN_PROJECT_OR_BROWSER_DISABLED" = "Search in Project or Disk Browser";
"SEARCH_IN_BEST_LOCATION_DISABLED" = "Multi-File Search for Selected Text";
"SEARCH_IN_BEST_LOCATION_NAME" = "Search for Selected Text in %@";
"SEARCH_WORD_IN_BEST_LOCATION_NAME" = "Search for “%@” in %@";

"SAVE_CLIPPING_NO_SET" = "(no set)";

"EARLY_ACCESS_PROMPT_MAIN" = "Enable Early Access?";
"EARLY_ACCESS_PROMPT_SUB" = "If you would like to receive notifications of pre-release maintenance updates for this version of BBEdit, use the “Enable” button to start receiving Early Access update notifications.";
"EARLY_ACCESS_BUTTON_OK" = "Enable Early Access";
"EARLY_ACCESS_DISABLE_PROMPT" = "Early Access is enabled.";
"EARLY_ACCESS_DISABLE_SUB" = "If you would like to stop receiving notifications of pre-release maintenance updates for this version of BBEdit, use the “Disable” button to return to normal update notifications.";
"EARLY_ACCESS_DISABLE_OK" = "Disable Early Access";

"CLIPPINGS_FOLDER_NAME" = "Clippings";
"FILTERS_FOLDER_NAME" = "Text Filters";
"HTML_TEMPLATES_FOLDER_NAME" = "HTML Templates";
"SCRIPTS_FOLDER_NAME" = "Scripts";
"STATIONERY_FOLDER_NAME" = "Stationery";

"CLIPPINGS_KEY_IN_USE" = "the clipping “%@”";
"FILTER_KEY_IN_USE" = "the text filter “%@”";
"SCRIPT_KEY_IN_USE" = "the script “%@”";
"STATIONERY_KEY_IN_USE" = "the stationery item “%@”";

"NOT_PERMITTED_ON_SELECTION" = "This operation is not permitted on the current selection.";
"REQUIRES_MODIFIABLE_DOCUMENT" = "This operation requires a modifiable text document.";
"REQUIRES_EDIT_WINDOW" = "This operation requires an edit window.";
"PRECONDITIONS_NOT_MET" = "The required pre-conditions for this operation have not been met.";

"CSS_PARSER_CIRCULAR_IMPORT" = "A recursive or circular @import was detected.";

"SET_MARKER_COMMAND" = "Set Marker…";
"SET_MARKER_COMMAND_ALT" = "Set Marker";
"CLEAR_MARKERS_COMMAND" = "Clear Markers…";
"CLEAR_MARKERS_COMMAND_ALT" = "Clear All Markers";
"FIND_MARK_ALL_COMMAND" = "Find & Mark All…";
"FIND_MARK_ALL_COMMAND_ALT" = "Find & Mark All";

"PLC_RESULTS_COMPLETE" = "Process Lines Containing completed.";
"PLC_OPERATION_REMOVED" = "removed";
"PLC_OPERATION_FOUND" = "found";
"PLC_ONE_RESULT" = "One line %@.";
"PLC_MORE_RESULTS" = "%@ lines %@.";
"PLC_GLOBAL_HISTORY" = "Global Find History";

"PROCESS_DUPLICATES_PROGRESS_TITLE" = "Process Duplicate Lines";
"PROCESS_DUPLICATES_MISSING_NAMED_PATTERN" = "No saved Grep pattern was found with this name.";
"PROCESS_DUPLICATES_NO_SUBPATTERN" = "The sort sub pattern was missing or empty.";
"PROCESS_DUPLICATES_BAD_MATCH_MODE" = "The matching mode wasn’t understood.";
"PROCESS_DUPLICATES_CLIPBOARD_ERROR" = "Only one result can go on the clipboard.";

"FIND_IN_REFERENCE" = "Find in Reference…";
"FIND_IN_REFERENCE_ALT" = "Find in Reference";

"MFS_NOT_FOUND" = "Not Found";
"MFS_STRING_NOT_FOUND_TEMPLATE" = "The string “%@” was not found.";
"MFS_PATTERN_NOT_FOUND_TEMPLATE" = "The pattern “%@” was not found.";

"OPEN_FILE_BY_NAME" = "Open File by Name…";
"OPEN_SELECTION" = "Open Selection";

"UNTITLED_DOCUMENT" = "untitled";
"UNTITLED_TYPE_TEMPLATE" = "untitled %@";
"UNTITLED_TYPE_COUNT_TEMPLATE" = "untitled %@ %@";
"UNTITLED_FOLDER_NAME" = "untitled folder";

"CANNOT_USE_BBXT_MAIN" = "“%@” cannot be used.";
"CANNOT_USE_BBXT_SUB" = "It is a BBEdit plug-in, which is not supported by this version of %s. Please contact the plug-in’s developer for assistance.";

"CLIPPINGS_NOT_AVAILABLE" = "Clippings are not available.";
"CLIPPINGS_EXEC_ERROR" = "An error occurred while expanding the #SYSTEM# placeholder: exit status %@.";

"COLOR_SCHEME_BUILT_IN_MAIN" = "This is a built-in color scheme.";
"COLOR_SCHEME_BUILT_IN_SUB" = "This color scheme is built in to the application, and cannot be changed. When you save it, BBEdit will ask you to save a new copy.";
"COLOR_SCHEME_LEGACY_MAIN" = "This color scheme has been converted.";
"COLOR_SCHEME_LEGACY_SUB" = "When you save this scheme, BBEdit will offer to save it under a new name, and convert it to the current version format.";
"COLOR_SCHEME_INSTALL_MAIN" = "Install “%@”?";
"COLOR_SCHEME_INSTALL_SUB" = "If you click the “Install” button, BBEdit will move this color scheme to your “Color Schemes” application support folder, and make it the active scheme.\n\nIf this scheme has unsaved changes, BBEdit will save it before installing.";
"COLOR_SCHEME_OVERWRITE_MAIN" = "“%@” is already installed. Do you want to overwrite it?";
"COLOR_SCHEME_OVERWRITE_SUB" = "If you click the “Install” button, BBEdit will move the currently installed color scheme to the Trash, and then move this color scheme to your “Color Schemes” application support folder, and make it the active scheme.\n\nIf this scheme has unsaved changes, BBEdit will save it before installing.";
"COLOR_SCHEME_INSTALL_ALREADY_MAIN" = "“%@” is already installed in your Color Schemes folder.";
"COLOR_SCHEME_INSTALL_ALREADY_SUB" = "You can use the “Apply” button to try it out, or select its name from the popup menu in the Text Colors preferences.";

"OVERWRITING_OPEN_DOC_MAIN" = "“%@” is already open in BBEdit.";
"OVERWRITING_OPEN_DOC_SUB" = "The document located at “%@” is already open, and cannot be overwritten.\n\nPlease save this document in a different location; or close the other document before saving this one.";
"OVERWRITING_OPEN_DOC_SELECT_OTHER" = "Select “%@”";

"PREFS_RESET_DEFAULTS_MAIN" = "Discard custom settings?";
"PREFS_RESET_DEFAULTS_SUB" = "BBEdit will restore your settings for “%@” to factory defaults.";
"PREFS_RESET_DEFAULTS_OK" = "Restore Defaults";

"DISKBROWSER_SANDBOX_MAIN" = "BBEdit needs permission to browse your computer.";
"DISKBROWSER_SANDBOX_SUB" = "macOS sandboxing restrictions require that you explicitly choose a location to browse. When you’ve done that, BBEdit will be able to examine that location (and everything in it) without further interruption.\n\nFor best results, we recommend that you select the top level of your startup disk.";

"NEW_DISK_BROWSER_OPEN_TITLE" = "New Disk Browser";
"NEW_DISK_BROWSER_OPEN_BUTTON" = "Browse";
"NEW_DISK_BROWSER_OPEN_PROMPT" = "Choose the directory to browse:";

"NEW_PROJECT_BUTTON_TITLE" = "Create";
"NEW_PROJECT_TITLE" = "Create New Project";
"NEW_PROJECT_PROMPT" = "Choose the location and name of your new project:";
"NEW_PROJECT_DEFAULT_NAME" = "untitled.bbprojectd";

"CUSTOM_COLOR_SETTINGS" = "Custom Settings";

"DIFF_SUBMENU_ALL" = "All";
"DIFF_SUBMENU_MORE" = "More (%@)";

"NO_SUPPORT_SYMLINKS_MAIN" = "Some of your Support folder items could not be used.";
"NO_SUPPORT_SYMLINKS_INFO" = "Aliases and symbolic links in (or to) the %s Application Support folder are no longer supported. The following items were found:\n\n%@\n\nYou should replace these with the actual folders to which they refer.";

RESULTS_LIST_FILENAME_NO_LINE = "File %@: ";
RESULTS_LIST_FILENAME_LINE = "File %@; ";
RESULTS_LIST_FILENAME_ONLY = "File %@";

RESULTS_LIST_LINE = "Line %ld: ";
RESULTS_LIST_KIND_NOTE = "Note: ";
RESULTS_LIST_KIND_WARNING = "Warning: ";
RESULTS_LIST_KIND_ERROR = "Error: ";

APPSTORE_BUY_ALREADY_SUBSCRIBED = "You already have an active subscription.";
APPSTORE_BUY_ALREADY_SUBSCRIBED_SUB = "You don’t need to purchase another one.";
APPSTORE_MONTHLY_BUTTON_FORMAT = "Monthly (%@ per month)";
APPSTORE_YEARLY_BUTTON_FORMAT = "Yearly (%@ per year)";
APPSTORE_NO_PRODUCT_LIST = "BBEdit couldn’t get the product list from the App Store.";
APPSTORE_NO_PRODUCT_LIST_SUB = "No more information is available.";
APPSTORE_PERIOD_DAY = "Day";
APPSTORE_PERIOD_WEEK = "Week";
APPSTORE_PERIOD_MONTH = "Month";
APPSTORE_PERIOD_YEAR = "Year";

ICLOUD_CONTAINER_COOKIE_CONTENTS = "This file exists only to force creation of a user-visible “BBEdit” folder inside of your top-level “iCloud Drive” folder.\n\nIf you wonder why this was necessary, ask Apple.\n";

ODB_CANT_NOTIFY_MAIN = "BBEdit was not permitted to send a save notification.";
ODB_CANT_NOTIFY_SUB = "This condition will occur if you previously clicked “Don’t Allow” to the system prompt requesting that you allow BBEdit to control the application from which you used an “Edit in BBEdit” command.\n\nClick the help button in this alert to go to a page on our web site with detailed information and instructions on how to resolve this.";

NEED_USR_LOCAL_BIN_MAIN = "BBEdit can’t install its command-line tools.";
NEED_USR_LOCAL_BIN_SUB_TEMPLATE = "The following directories need to exist, but don’t, and BBEdit is unable to create them.\n\n%@\nBBEdit can try to ask Terminal to do it for you. You may need to enter your administrator password.";

"CHOCK LOCK ENGAGED OK" = "USE IT WISELY OR YOU WILL FEEL THE FLESHY PALM";

"APP_MOVED_MAIN" = "BBEdit has been moved or renamed.";
"APP_MOVED_SUB" = "You must now quit and relaunch the application; otherwise it will malfunction.";
"APP_MOVED_OK" = "Relaunch";

"SHELL_WORKSHEET_SHELL_NOT_RUNNING" = "<shell not running>";

"CANON_SAME_FILE_MAIN" = "Please don’t use a canon file to canonize itself.";
"CANON_SAME_FILE_SUB" = "That way lies madness.";

"COMPARE_NO_DIFF_MAIN" = "No Differences";
"COMPARE_FILES_IDENTICAL" = "These files are identical.";
"COMPARE_FILE_NOT_FOUND" = "The named file was not found in the target directory.";
"COMPARE_SAME_ITEM" = "These items couldn’t be compared, because they are the same file (or folder).";
"COMPARE_TYPE_MISMATCH" = "You cannot compare a file to a folder (or vice versa).";
"COMPARE_FILES_IDENTICAL" = "These files are identical.";
"COMPARE_FOLDERS_IDENTICAL" = "All of the files being compared are identical.";
"COMPARE_FOLDERS_DISJOINT" = "These folders have no files in common.";
"COMPARE_AGAINST_DISK_TITLE" = "Compare Against Disk File";
"COMPARE_AGAINST_PREVIOUS_VERSION" = "Compare Against Previous Version";
"COMPARE_AGAINST_DISK_NO_DIFFS" = "No differences found.";

"TOOLS_INSTALL_FAIL_MAIN" = "BBEdit could not install the command line tools.";
"TOOLS_INSTALL_FAIL_SUB_UNKNOWN" = "An unknown error has occurred.";
"TOOLS_INSTALL_FAIL_SUB_EACCES" = "BBEdit was unable to remove one or more of the old tools. Please remove them manually, and use this command again.";
"TOOLS_INSTALL_FAIL_SUB_CODE" = "An error (%@) occurred while trying to install one the tools.";

"APPSTORE_REVIEW_MAIN" = "Do you love BBEdit?";
"APPSTORE_REVIEW_SUB" = "If you’ve been enjoying your time with BBEdit, please leave us a review in the Mac App Store. We would really appreciate it!\n\nClicking “Leave a Review” will open BBEdit’s page in the App Store application, and prompt you for your review.\n\nIf you are having a technical issue or would like to request a feature, please use the “Get Help” button, which will open the BBEdit support page on our web site. We’ll be happy to help.";
"APPSTORE_REVIEW_OK" = "Leave a Review";
"APPSTORE_REVIEW_LATER" = "Maybe Later";
"APPSTORE_REVIEW_GETHELP" = "Get Help";

"EXPORTED_RESULTS_DEFAULT_NAME" = "Exported Results.txt";

"REGISTRATION_HTTP_ERROR_MAIN" = "An error occurred while submitting your signup request.";
"REGISTRATION_HTTP_ERROR_SUB" = "The server reported: %@ (%@)";
"REGISTRATION_COMPLETE_MAIN" = "Your signup request has been received!";
"REGISTRATION_COMPLETE_SUB" = "Please check your “%@” email account for a confirmation message.";

"TEXT_FILE_KIND" = "text file";
"TEXT_EXTENSION_NOT_CONFIGURED" = "(not configured)";

"WAITING_FOR_ATSD" = "Waiting for macOS…";

"REPLACE_ALL_RESULTS_SINGLE" = "One occurrence of “%@” was replaced with “%@”.";
"REPLACE_ALL_RESULTS_MULTI" = "%@ occurrences of “%@” were replaced with “%@”.";
"REPLACE_ALL_RESULTS_TIMING_SINGLE" = "One occurrence of “%@” was replaced with “%@”.\n(Elapsed time: %.3lf seconds.)";
"REPLACE_ALL_RESULTS_TIMING_MULTI" = "%@ occurrences of “%@” were replaced with “%@”.\n(Elapsed time: %.3lf seconds.)";

"RECENT_NOT_FOUND_MAIN" = "The item “%@” could not be found.";
"RECENT_NOT_FOUND_SUB" = "“%@” was missing or is on an unavailable disk.";
"RECENT_NOT_FOUND_REMOVE" = "Forget Item";

"QUARANTINE_MAIN" = "macOS will quarantine this file.";
"QUARANTINE_SUB" = "OS security policies will quarantine any executable file that you save, because BBEdit has not been granted permission to write executable files.\n\nYou can save this file anyway, but you will not be able to run it from the Terminal command line or from other applications.\n\nClick the “Allow Access” button and proceed as prompted to allow BBEdit to create executable files without OS quarantine.";
"QUARANTINE_ALLOW" = "Allow Access…";
"QUARANTINE_SAVE" = "Save Anyway";

"UNIX_SCRIPT_NO_OUTPUT" = "[“%@” produced no output]\n";

"MOVE_TO_DISPLAY_TEMPLATE" = "Move to %@";
"MOVE_ALL_TO_DISPLAY_TEMPLATE" = "Move All Windows to %@";

"NO_RESCUE_SUMMARY_AVAILABLE" = "(no summary available)";

"FTP_SAVE_CHANGED_ON_SERVER_MAIN" = "This file may have been modified on the server.";
"FTP_SAVE_CHANGED_ON_SERVER_SUB" = "The file at %@ may have been changed by another user, or by a process on the server itself.\n\nIf so, saving this document may cause data loss. Are you sure you wish to proceed?";
"FTP_SAVE_ACTION" = "Save Anyway";

"CREATE_BUTTON_TITLE" = "Create";
"NEW_TEXT_FILE_TITLE" = "Create New Text File";
"NEW_FOLDER_TITLE" = "Create New Folder";

"PREFERENCES_TITLE" = "%s Preferences";
"PREFERENCES_MODULE_TITLE" = "%s %@ Preferences";
"PREFERENCES_TITLE_NO_MATCHES" = "%s Preferences (no matches)";

"ADD_TO_PROJECT_BUTTON" = "Add to Project";

"NO_PREVIOUS_UNIX_COMMAND" = "(command history is empty)";
"CLEAR_UNIX_COMMAND_HISTORY" = "Clear Command History";
"CLEAR_UNIX_HISTORY_MAIN" = "Permanently clear the command history?";
"CLEAR_UNIX_HISTORY_SUB" = "This operation cannot be undone.";
"CLEAR_UNIX_HISTORY_OK" = "Clear History";

"UNCLEAN_QUIT_MAIN" = "It looks like BBEdit did not quit normally the last time it was used.";
"UNCLEAN_QUIT_SUB" = "Do you want to continue reopening any documents that were open at the time?\n\n(BBEdit will still reopen any untitled documents, as well as documents with unsaved changes.)";
"UNCLEAN_QUIT_OK" = "Reopen Documents";
"UNCLEAN_QUIT_CANCEL" = "Don’t Reopen Documents";

"BACKUPS_FOLDER_NAME" = "BBEdit Backups";
